In [4]:
import numpy as np
import pandas as pd
#dfp = pd.DataFrame([['Bella','Labrador','Cafe', 56, 24, '2013-07-01'], ['Charlie','Poodle','Negro', 43, 24, '2016-09-16'], ['Lucy','Chow Chow','Café', 46, 24, '2014-08-35'], ['Cooper','Schnauzer','Gris', 49, 17, '2011-12-11'], ['Bernie','San Bernardo','Blanco', 77, 74, '2018-02-27'], ['Max','Chow Chow','Blanco', 45, 28, '2019-03-27'], ['Reed','Schnauzer','Negro', 45, 15, '2017-09-18']], index = [0, 1, 2, 3, 4, 5, 6], columns = ["Nombre", "Raza", "Color", "Altura_CM", "Peso_KG", "Fecha_Nac"])
arreglo = np.array([['Bella','Labrador','Cafe', 56, 24, '2013-07-01'], 
                    ['Charlie','Poodle','Negro', 43, 24, '2016-09-16'], 
                    ['Lucy','Chow Chow','Café', 46, 24, '2014-08-35'], 
                    ['Cooper','Schnauzer','Gris', 49, 17, '2011-12-11'], 
                    ['Bernie','San Bernardo','Blanco', 77, 74, '2018-02-27'], 
                    ['Max','Chow Chow','Blanco', 45, 28, '2019-03-27'], 
                    ['Reed','Schnauzer','Negro', 45, 15, '2017-09-18']])
arreglo

array([['Bella', 'Labrador', 'Cafe', '56', '24', '2013-07-01'],
       ['Charlie', 'Poodle', 'Negro', '43', '24', '2016-09-16'],
       ['Lucy', 'Chow Chow', 'Café', '46', '24', '2014-08-35'],
       ['Cooper', 'Schnauzer', 'Gris', '49', '17', '2011-12-11'],
       ['Bernie', 'San Bernardo', 'Blanco', '77', '74', '2018-02-27'],
       ['Max', 'Chow Chow', 'Blanco', '45', '28', '2019-03-27'],
       ['Reed', 'Schnauzer', 'Negro', '45', '15', '2017-09-18']],
      dtype='<U21')

In [5]:
dfp = pd.DataFrame(data=arreglo, columns=["Nombre", "Raza", "Color", "Altura_CM", "Peso_KG", "Fecha_Nac"])
dfp['Altura_CM'] = dfp['Altura_CM'].astype(int)
dfp['Peso_KG'] = dfp['Peso_KG'].astype(int)
dfp

    Nombre          Raza   Color  Altura_CM  Peso_KG   Fecha_Nac
0    Bella      Labrador    Cafe         56       24  2013-07-01
1  Charlie        Poodle   Negro         43       24  2016-09-16
2     Lucy     Chow Chow    Café         46       24  2014-08-35
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27
5      Max     Chow Chow  Blanco         45       28  2019-03-27
6     Reed     Schnauzer   Negro         45       15  2017-09-18

In [6]:
dfp.columns

Index(['Nombre', 'Raza', 'Color', 'Altura_CM', 'Peso_KG', 'Fecha_Nac'], dtype='object')

In [8]:
#Empieza desde el cero y el 7 no lo cuenta asi que es de 0 a 6
dfp.index

RangeIndex(start=0, stop=7, step=1)

In [9]:
#Voy a cambiar la columna "Nombre" como los nombres de los renglones de la tabla
dfp_ind = dfp.set_index("Nombre")
dfp_ind

                 Raza   Color  Altura_CM  Peso_KG   Fecha_Nac
Nombre
Bella        Labrador    Cafe         56       24  2013-07-01
Charlie        Poodle   Negro         43       24  2016-09-16
Lucy        Chow Chow    Café         46       24  2014-08-35
Cooper      Schnauzer    Gris         49       17  2011-12-11
Bernie   San Bernardo  Blanco         77       74  2018-02-27
Max         Chow Chow  Blanco         45       28  2019-03-27
Reed        Schnauzer   Negro         45       15  2017-09-18

In [10]:
#Para deshacer la creacion de los indices que se hizo en la colunma anterior
dfp_ind = dfp_ind.reset_index()
dfp_ind

    Nombre          Raza   Color  Altura_CM  Peso_KG   Fecha_Nac
0    Bella      Labrador    Cafe         56       24  2013-07-01
1  Charlie        Poodle   Negro         43       24  2016-09-16
2     Lucy     Chow Chow    Café         46       24  2014-08-35
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27
5      Max     Chow Chow  Blanco         45       28  2019-03-27
6     Reed     Schnauzer   Negro         45       15  2017-09-18

In [11]:
dfp_ind = dfp.set_index("Nombre")
#Con la operacion anterior agrego los indices y con la siguiente instruccion voy a remover los indices (o sea borrar la columna)
dfp_ind = dfp_ind.reset_index(drop = True)
dfp_ind

           Raza   Color  Altura_CM  Peso_KG   Fecha_Nac
0      Labrador    Cafe         56       24  2013-07-01
1        Poodle   Negro         43       24  2016-09-16
2     Chow Chow    Café         46       24  2014-08-35
3     Schnauzer    Gris         49       17  2011-12-11
4  San Bernardo  Blanco         77       74  2018-02-27
5     Chow Chow  Blanco         45       28  2019-03-27
6     Schnauzer   Negro         45       15  2017-09-18

In [14]:
#Opcion de busqueda en la base sin indices
dfp[dfp["Nombre"].isin(["Bernie","Max"])]

   Nombre          Raza   Color  Altura_CM  Peso_KG   Fecha_Nac
4  Bernie  San Bernardo  Blanco         77       74  2018-02-27
5     Max     Chow Chow  Blanco         45       28  2019-03-27

In [15]:
#Busqueda de nombres en la base con indices de nombre
dfp_ind = dfp.set_index("Nombre")
dfp_ind.loc[["Bernie","Max"]]

                Raza   Color  Altura_CM  Peso_KG   Fecha_Nac
Nombre
Bernie  San Bernardo  Blanco         77       74  2018-02-27
Max        Chow Chow  Blanco         45       28  2019-03-27

In [16]:
#Se puede hacer uso de indices secundarios
dfp_ind2 = dfp.set_index(["Raza","Color"])
dfp_ind2

                      Nombre  Altura_CM  Peso_KG   Fecha_Nac
Raza         Color
Labrador     Cafe      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
Chow Chow    Café       Lucy         46       24  2014-08-35
Schnauzer    Gris     Cooper         49       17  2011-12-11
San Bernardo Blanco   Bernie         77       74  2018-02-27
Chow Chow    Blanco      Max         45       28  2019-03-27
Schnauzer    Negro      Reed         45       15  2017-09-18

In [17]:
#Consulta sobre una caracteristica
dfp_ind2.loc[["Schnauzer","Poodle"]]

                  Nombre  Altura_CM  Peso_KG   Fecha_Nac
Raza      Color
Schnauzer Gris    Cooper         49       17  2011-12-11
          Negro     Reed         45       15  2017-09-18
Poodle    Negro  Charlie         43       24  2016-09-16

In [18]:
#Consulta sobre dos caracteristicas con tuplas
dfp_ind2.loc[[("Schnauzer", "Gris"), ("Poodle", "Negro")]]

                  Nombre  Altura_CM  Peso_KG   Fecha_Nac
Raza      Color
Schnauzer Gris    Cooper         49       17  2011-12-11
Poodle    Negro  Charlie         43       24  2016-09-16

In [19]:
#Ordenamiento de la tabla con el primer indice de referencia
dfp_ind2.sort_index()

                      Nombre  Altura_CM  Peso_KG   Fecha_Nac
Raza         Color
Chow Chow    Blanco      Max         45       28  2019-03-27
             Café       Lucy         46       24  2014-08-35
Labrador     Cafe      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
San Bernardo Blanco   Bernie         77       74  2018-02-27
Schnauzer    Gris     Cooper         49       17  2011-12-11
             Negro      Reed         45       15  2017-09-18

In [20]:
#Ordenamiento por mas de un indice
dfp_ind2.sort_index(level = ["Color", "Raza"], ascending = [True, False])

                      Nombre  Altura_CM  Peso_KG   Fecha_Nac
Raza         Color
San Bernardo Blanco   Bernie         77       74  2018-02-27
Chow Chow    Blanco      Max         45       28  2019-03-27
Labrador     Cafe      Bella         56       24  2013-07-01
Chow Chow    Café       Lucy         46       24  2014-08-35
Schnauzer    Gris     Cooper         49       17  2011-12-11
             Negro      Reed         45       15  2017-09-18
Poodle       Negro   Charlie         43       24  2016-09-16

In [25]:
#Ejercicios de Silicing a un DataFrame
#Extraccion de los 3 primeros registros
#Si no se hace referencia al numero inicial del rango este toma como default el cero
dfp[:3]

    Nombre       Raza  Color  Altura_CM  Peso_KG   Fecha_Nac
0    Bella   Labrador   Cafe         56       24  2013-07-01
1  Charlie     Poodle  Negro         43       24  2016-09-16
2     Lucy  Chow Chow   Café         46       24  2014-08-35

In [26]:
#Extraccion de los numeros del 2 al 4 (se pone 5)
dfp[2:5]

   Nombre          Raza   Color  Altura_CM  Peso_KG   Fecha_Nac
2    Lucy     Chow Chow    Café         46       24  2014-08-35
3  Cooper     Schnauzer    Gris         49       17  2011-12-11
4  Bernie  San Bernardo  Blanco         77       74  2018-02-27

In [27]:
#Para extraer todo el DataFrame
dfp[:]

    Nombre          Raza   Color  Altura_CM  Peso_KG   Fecha_Nac
0    Bella      Labrador    Cafe         56       24  2013-07-01
1  Charlie        Poodle   Negro         43       24  2016-09-16
2     Lucy     Chow Chow    Café         46       24  2014-08-35
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27
5      Max     Chow Chow  Blanco         45       28  2019-03-27
6     Reed     Schnauzer   Negro         45       15  2017-09-18

In [28]:
#Extraccion de dataframes con indices jerarquicos
dfp_ind2 = dfp.set_index(["Raza","Color"])
dfp_ind2

                      Nombre  Altura_CM  Peso_KG   Fecha_Nac
Raza         Color
Labrador     Cafe      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
Chow Chow    Café       Lucy         46       24  2014-08-35
Schnauzer    Gris     Cooper         49       17  2011-12-11
San Bernardo Blanco   Bernie         77       74  2018-02-27
Chow Chow    Blanco      Max         45       28  2019-03-27
Schnauzer    Negro      Reed         45       15  2017-09-18

In [29]:
#Para poder hacer un Slicing de algun rango de indices, estpos deben de estar ordenados primero
dfp_ind2 = dfp_ind2.sort_index(level = 'Raza', ascending = True)
dfp_ind2

                      Nombre  Altura_CM  Peso_KG   Fecha_Nac
Raza         Color
Chow Chow    Blanco      Max         45       28  2019-03-27
             Café       Lucy         46       24  2014-08-35
Labrador     Cafe      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
San Bernardo Blanco   Bernie         77       74  2018-02-27
Schnauzer    Gris     Cooper         49       17  2011-12-11
             Negro      Reed         45       15  2017-09-18

In [30]:
#Extraccion de los indices 
dfp_ind2.loc["Chow Chow":"Labrador"]

                 Nombre  Altura_CM  Peso_KG   Fecha_Nac
Raza      Color
Chow Chow Blanco    Max         45       28  2019-03-27
          Café     Lucy         46       24  2014-08-35
Labrador  Cafe    Bella         56       24  2013-07-01

In [31]:
#Para hacer Slicing del DataFrame con indices multiples usando Tuplas
dfp_ind2.loc[("Chow Chow", "Café"):("Schnauzer","Gris")]

                      Nombre  Altura_CM  Peso_KG   Fecha_Nac
Raza         Color
Chow Chow    Café       Lucy         46       24  2014-08-35
Labrador     Cafe      Bella         56       24  2013-07-01
Poodle       Negro   Charlie         43       24  2016-09-16
San Bernardo Blanco   Bernie         77       74  2018-02-27
Schnauzer    Gris     Cooper         49       17  2011-12-11

In [34]:
#Para hacer slicing de las columnas en DataFrame
dfp_ind3 = dfp_ind2.loc[:,"Nombre":"Peso_KG"]
dfp_ind3

                      Nombre  Altura_CM  Peso_KG
Raza         Color
Chow Chow    Blanco      Max         45       28
             Café       Lucy         46       24
Labrador     Cafe      Bella         56       24
Poodle       Negro   Charlie         43       24
San Bernardo Blanco   Bernie         77       74
Schnauzer    Gris     Cooper         49       17
             Negro      Reed         45       15

In [36]:
dfp_ind4 = dfp_ind2.loc[("Chow Chow", "Café"):("Schnauzer","Gris"),"Nombre":"Peso_KG"]
dfp_ind4

                      Nombre  Altura_CM  Peso_KG
Raza         Color
Chow Chow    Café       Lucy         46       24
Labrador     Cafe      Bella         56       24
Poodle       Negro   Charlie         43       24
San Bernardo Blanco   Bernie         77       74
Schnauzer    Gris     Cooper         49       17

In [37]:
#Extraccion simultanea de renglones y columnas
#Opcion alternativa por numero de renglon y numero de columna
dfp_ind4.iloc[1:3,0:1]

                 Nombre
Raza     Color
Labrador Cafe     Bella
Poodle   Negro  Charlie

In [39]:
#Creacion de la table pivote
dfp_altura_raza_color = dfp.pivot_table("Altura_CM", index = "Raza", columns = "Color")
dfp_altura_raza_color

Color         Blanco  Cafe  Café  Gris  Negro
Raza
Chow Chow       45.0   NaN  46.0   NaN    NaN
Labrador         NaN  56.0   NaN   NaN    NaN
Poodle           NaN   NaN   NaN   NaN   43.0
San Bernardo    77.0   NaN   NaN   NaN    NaN
Schnauzer        NaN   NaN   NaN  49.0   45.0

In [40]:
#Extraccion de registros
dfp_altura_raza_color.loc["Labrador":"San Bernardo"]

Color         Blanco  Cafe  Café  Gris  Negro
Raza
Labrador         NaN  56.0   NaN   NaN    NaN
Poodle           NaN   NaN   NaN   NaN   43.0
San Bernardo    77.0   NaN   NaN   NaN    NaN

In [41]:
#Calculo del promedio para TODOS los renglones (por columna)
dfp_altura_raza_color.mean(axis = "index")

Color
Blanco    61.0
Cafe      56.0
Café      46.0
Gris      49.0
Negro     44.0
dtype: float64

In [42]:
dfp_altura_raza_color.mean(axis = "columns")

Raza
Chow Chow       45.5
Labrador        56.0
Poodle          43.0
San Bernardo    77.0
Schnauzer       47.0
dtype: float64